Revit 2021.1 API
UnitUtils.GetValidDisplayUnits Method
 Gets all valid display units.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
Since: 2014
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2021 and may be removed in a future version of Revit. Please use the `GetAllUnits()` method instead.")]
public static IList<DisplayUnitType> GetValidDisplayUnits()
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2021 and may be removed in a future version of Revit. Please use the `GetAllUnits()` method instead.")> _
Public Shared Function GetValidDisplayUnits As IList(Of DisplayUnitType)
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2021 and may be removed in a future version of Revit. Please use the `GetAllUnits()` method instead.")]
public:
static IList<DisplayUnitType>^ GetValidDisplayUnits()
Return Value
 The valid display units.
Remarks
 A display unit is considered valid if it is an actual unit like meters or feet. Obsolete values and the special values DUT_CUSTOM and DUT_UNDEFINED are not considered valid.
See Also
UnitUtils Class
GetValidDisplayUnits Overload
Autodesk.Revit.DB Namespace